yym36100/at32_blinky/AT32F403AVGT7_WorkBench/project/src/main.c
/* add user code begin Header */
/**
 **************************************************************************
 * @file     main.c
 * @brief    main program
 **************************************************************************
 *                       Copyright notice & Disclaimer
 *
 * The software Board Support Package (BSP) that is made available to
 * download from Artery official website is the copyrighted work of Artery.
 * Artery authorizes customers to use, copy, and distribute the BSP
 * software and its related documentation for the purpose of design and
 * development in conjunction with Artery microcontrollers. Use of the
 * software is governed by this copyright notice and the following disclaimer.
 *
 * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
 * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
 * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
 * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
 * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
 *
 **************************************************************************
 */
/* add user code end Header */

/* Includes ------------------------------------------------------------------*/
#include "at32f403a_407_wk_config.h"

/* private includes ----------------------------------------------------------*/
/* add user code begin private includes */

/* add user code end private includes */

/* private typedef -----------------------------------------------------------*/
/* add user code begin private typedef */

/* add user code end private typedef */

/* private define ------------------------------------------------------------*/
/* add user code begin private define */

/* add user code end private define */

/* private macro -------------------------------------------------------------*/
/* add user code begin private macro */

/* add user code end private macro */

/* private variables ---------------------------------------------------------*/
/* add user code begin private variables */

/* add user code end private variables */

/* private function prototypes --------------------------------------------*/
/* add user code begin function prototypes */

/* add user code end function prototypes */

/* private user code ---------------------------------------------------------*/
/* add user code begin 0 */
#define STEP_DELAY_MS                    50

/* delay variable */
static __IO uint32_t fac_us;
static __IO uint32_t fac_ms;

void delay_ms(uint16_t nms) {
	uint32_t temp = 0;
	while (nms) {
		if (nms > STEP_DELAY_MS) {
			SysTick->LOAD = (uint32_t) (STEP_DELAY_MS * fac_ms);
			nms -= STEP_DELAY_MS;
		} else {
			SysTick->LOAD = (uint32_t) (nms * fac_ms);
			nms = 0;
		}
		SysTick->VAL = 0x00;
		SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
		do {
			temp = SysTick->CTRL;
		} while ((temp & 0x01) && !(temp & (1 << 16)));

		SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
		SysTick->VAL = 0x00;
	}
}

void delay_init() {
	/* configure systick */
	systick_clock_source_config(SYSTICK_CLOCK_SOURCE_AHBCLK_NODIV);
	fac_us = system_core_clock / (1000000U);
	fac_ms = fac_us * (1000U);
}

void myprintf(char *t) {
	while (*t) {
		while (usart_flag_get(USART1, USART_TDBE_FLAG)==RESET);
		usart_data_transmit(USART1, *t++);
	}
}

/* add user code end 0 */

/**
 * @brief main function.
 * @param  none
 * @retval none
 */
int main(void) {
	/* add user code begin 1 */

	/* add user code end 1 */

	/* system clock config. */
	wk_system_clock_config();

	/* config periph clock. */
	wk_periph_clock_config();

	/* init debug function. */
	wk_debug_config();

	/* nvic config. */
	wk_nvic_config();

	/* init usart1 function. */
	wk_usart1_init();

	/* init gpio function. */
	wk_gpio_config();

	/* add user code begin 2 */
	delay_init();

	int a = 0;

	/* add user code end 2 */
	myprintf("Hello world!\n");

	while (1) {
		/* add user code begin 3 */
		gpio_bits_write(GPIOA, GPIO_PINS_0, a);
		a ^= 1;
		delay_ms(100);
		myprintf(".");

		/* add user code end 3 */
	}
}
